import sys


def solve():
    # Маалыматтарды тез окуу

    N = int(input())

    # 2ден баштап квадраттык тамырга чейин издейбиз
    i = 2
    while i * i <= N:
        # Эгерде бөлүнсө, демек бул жөнөкөй бөлүүчү
        print(f'N = {N} i = {i}')
        if N % i == 0:
            print(i)
            # Ушул бөлүүчүнү N-дин ичинен толугу менен тазалайбыз (кайталанбашы үчүн)
            while N % i == 0:
                N //= i
        i += 1

    # Эгерде цикл бүткөндөн кийин N 1ден чоң бойдон калса,
    # ал өзү да жөнөкөй сан болуп саналат
    if N > 1:
        print(N)


if __name__ == '__main__':
    solve()